# 질문 리스트


## 1. 프로세스와 스레드의 차이
 * 프로세스는 OS에서 자원을 할당받아 작업을 실행하는 단위
 * 스레드는 프로세스가 할당 받은 자원을 이용하여 프로세스에서 진행해야할 작업을 담당하는 단위
 * 프로세스끼리는 메모리를 공유할 수 없지만, 스레드끼리는 프로세스 할당 자원 내에서 자원 공유가 가능하다.
 * 여러 스레드를 이용하여 공유된 자원으로 효율적인 작업처리가 가능하지만, 여러 스레드이다보니 동기화 이슈를 잘 처리해야하는 주의점이 있다.
 
 
## 2. Blocking vs Non-blocking / Sync vs Async
#### Blocking vs Non-blocking
 * 호출되는 함수의 return이 바로 오느냐 / 오지 않느냐의 차이
 * return이 온다는 의미는 제어권을 넘겨준다는 의미. return이 오지 않는 Blocking의 경우 return이 올떄까지 대기하게 된다.

#### Sync vs Async
 * 작업 완료 확인 여부를 누가 신경쓰느냐에 따른 차이
 * 여기서 `누가`는 함수를 호출하는 주체 A와 함수 호출을 받은 B 라고 정리하자.
 * Sync : A가 B에게서 함수 완료 확인이 올때까지 계속 기다리거나, 완료되었는지 주기적으로 물어서 완료 여부를 체크함
 * Async : A는 B 함수 호출 후 본인 할일을 하고, B가 작업 완료 후 A에게 완료되었다는 callback을 보내줌.
